<?php 

global $section;
function getTitle($l)
{
	if($l==1){
		return "Пресс-релизы";
	}
	return "Press releases";
}
function insertSection($l){
?>

<b>Ключ от Вашей клавиатуры</b>

<p>Однажды, я обратил внимание на то, как моя сотрудница работала за
компьютером. Она в совершенствии владела десятипальцевым методом печати, но
каждый раз, когда ей приходилось сделать с вводимым текстом какие-либо
преобразования, бралась за мышку и начинала кликать и выбирать пункты меню.
Тогда я задумался над тем, что как бы быстро она не печатала, замедляющим
фактором в ее работе всегда были операции, для которых требовалось выполнить
более одного действия. Задумывались ли Вы хоть раз, насколько эффективна
Ваша работа за компьютером? Как часто для выполнения какого-либо действия
Вам приходится пробираться сквозь многоуровневые меню совершая бесчисленное
число кликов мышкой вместо того, что бы сделать это одним нажатием "горячей
клавиши"? Безусловно, основной причиной неэффективности зачастую являются
неправильно спроектированные интерфейсы программ. А, как известно, если
кто-то сделал что-то неправильно, всегда найдется умелец, который это
исправит даже, если речь идет об исправлении огрехов проектирования
интерфейсов платного программного обеспечения с закрытыми исходными кодами.

<p>Как Вы уже наверное догадались, речь пойдет о программах так или иначе
ускоряющих нашу с Вами работу за компьютером - утилитах позволяющих
создавать "глобальные горячие клавиши". Под "глобальными" мы будем понимать
горячие клавиши, действующие не в каком-то конкретном приложении, а
глобально в пределах всей Вашей операционной системы.

<p>Как правило, утилиты данного типа принадлежат к сегменту рынка под названием
"shareware". Ваш покорный слуга перепробовал много подобных утилит, но
регистрационный ключ решился купить только к одной из них. Уж очень хорошей
она оказалась во всех отношениях, что не часто можно встретить среди ее
"шароварных" собратьев. Да и функциональность, заложенная в нее автором
впечатляет: она позволяет работать не только с "горячими клавишами", но и
управлять процессами, запущенными в Вашей системе, окнами, регулировать
громкость, использовать несколько рабочих столов и много чего еще. Любители
оболтать по IM коих сейчас предостаточно или повисеть в конференции на
рабочем месте, по достоинству оценят функцию "Boss клавиша". Она позволяет
одним нажатием "горячей клавиши" спрятать все неугодные Вашему руководству
приложения. Мелочь, а приятно.

<p>Итак, настал момент представить героя нашей статьи. Знакомьтесь - <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a>.
Между прочим, детище отечественного производителя, что, безусловно, не может
не радовать.

<p>Как я уже говорил, количество функций <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> просто огромно, кроме того, в
<a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> имеется возможность использования плагинов предоставляющих
дополнительную функциональность. Осилить все функции и сразу, Вам, скорее
всего не удастся, тем не менее, начав использовать часть из них, постепенно
начинаешь втягиваться и использовать все новые и новые возможности.

<p>После установки и запуска <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> в трее появляется значок, напоминающий
три клавиши, по которому периодически пробегают зеленые столбики,
указывающие степень загруженности процессора, а если к значку подвести
курсор, то можно увидеть более детальную информацию об использовании
процессора и памяти.

<p>Всяческой похвалы заслуживает справочная информация. Достаточно редкое
явление для "shareware" грамотный и продуманный хелп, читая который сразу же
можно попробовать те или иные сочетания клавиш. По умолчанию, <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> уже
имеет ряд предустановленных "горячих клавиш", которые, впрочем, можно в
любой момент переназначить по своему усмотрению.

<p>Первое что бросается в глаза при создании "горячей клавиши", это поистине
огромный выбор вариантов: <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> различает левый и правый Shift, т.е. Вы
можете приписывать разные действия для одной и той же комбинации в
зависимости от того, какой Shift используется. То же самое касается и других
парных клавиш. Возможно привязывание действий на нажатие или отпускание
любой клавиши. Реагирует <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> 
и на так называемые "мультимедийные клавиши" и на действия мыши, будь то подведение курсора к краю экрана или
даже описывание им определенных фигур.

<p>Понимает <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> и последовательное нажатие клавиш, что позволяет создавать
группы "горячих клавиш" схожие по действию. Так я, например, в дополнение к
имеющемуся по умолчанию сочетанию Ctrl+M запускающему почтовый клиент,
добавил сочетание Ctrl+M+A которое запускает создание нового письма для
моего сослуживца Андрея. Теперь держа клавишу Ctrl и нажимая последовательно
клавиши M и A, у меня запускается создание нового письма для Андрея. С
присвоением "горячих клавиш" двум другим моими коллегами Максиму и Михаилу
возникла заминка, которая, впрочем, длилась недолго: им были присвоены
сочетания Ctrl+M+M+A и Ctrl+M+M+I соответственно.

<p>Безусловно, <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> умеет преобразовывать выделенный текст независимо от
того, в каком приложении это происходит. Среди преобразований как достаточно
стандартные вещи вроде изменения раскладки и регистра так и очень необычные.
Например, нажав сочетание Ctrl+R можно выполнить выделенный текст, так, как
будто вы ввели его в командной строке. А, выделив, например такое
арифметическое выражение: "sqrt(sin(1)+cos(2))*abs(sin(5))=" и нажав
Ctrl+Alt+R получить результат 0.62. Следует заметить, что
<a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> воспринимает не только арифметические выражения, но и вообще любую
программу на JavaScript, что делает возможным вычисление очень сложных
выражений.

<p>Если сразу не удается запомнить все сочетания клавиш, то, выделив текст,
можно нажать Ctrl+"Левый клик" и вызвать контекстное меню, в котором будут
перечислены все возможные действия, а так же соответствующие им "горячие клавиши".

<p>Все, кто работает с компьютером более или менее серьезно, давно осознали
необходимость нескольких буферов обмена. Как правило, хватает двух, но
иногда требуется и более. В <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> по умолчанию три буфера, однако, их
число не ограниченно, и Вы можете создать столько буферов обмена, сколько
Вам необходимо. Примечателен тот факт, что буферы обмена в <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> хранят
информацию даже после перезагрузки системы, в связи с чем, я бы назвал их
"энергонезависимые буферы обмена". Но и это еще не все. Каждый буфер обмена
в <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> имеет историю и, нажав соответствующую клавишу (по умолчанию это
Win+1..3), вы увидите контекстное меню, в котором будут перечислены
несколько последних значений буфера. Количество знаений, конечно же
задается пользователем.

<p>Помимо всего прочего, <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> обладает широкими возможностями по управлению
окнами запущенных приложений. Если нажать Ctrl+Gray Minus (клавиша "-" на
цифровой клавиатуре), то появится контекстное меню, с помощью которого
можно, например, спрятать окно в трей. После выбора данного пункта, любое
коно будет помещено в трей, независимо от того, снабдили ее авторы такой
возможностью или нет. Если у Вас в трее скопилось много иконок, не беда.
Щелкаем, по иконке правой кнопкой мыши и выбираем в меню "Отклеить от трея".
В результате этого действия, наша иконка выберется на свободу, и мы сможем
поместить ее в любой части экрана.

<p>Еще одной, безусловно, полезной функцией является возможность выполнять
любые действия по расписанию. Для этого достаточно в настройках "горячей клавиши" 
выбрать пункт "Активировать по расписанию".

<p>Единственным минусом, замеченным мной при работе с <a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> было жесткое
убеждение автора нашедшее отражение во всех главах справочной системы о том,
что все клавиатуры имеют 101-104 клавиши. Поскольку моя клавиатура имеет
всего 83 клавиши, то утверждения вроде "это самая левая верхняя клавиша,
сразу под кнопкой Escape" остались мной не поняты, поскольку автор имел в
виду клавишу, которая на моей клавиатуре является самой правой и расположена
на одном уровне с Escape. Но это скорее из числа придирок, а в целом конечно
<a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> это более чем достойное приложение, которое способно повлиять на
Вашу продуктивность работы за компьютером не меньше, чем всем известная
программа Шахиджаняна, обучающая десятипальцевому методу печати. В
завершение скажу, что стоимость программы составляет 200 руб. для России и
$30 для всех остальных, что, на мой взгляд, вполне приемлемо. Загрузить
<a href="http://www.wiredplane.com/wirekeys/info.shtml">WireKeys</a> можно с сайта разработчика: <a href="http://www.wiredplane.com/wirekeys/info.shtml">http://www.wiredplane.com/WireKeys/</a>

<?php 
}
?>
